Revit 2027 API
Transform1D.Multiply Method
 Multiplies this transformation by the specified transformation and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform1D Multiply(
	Transform1D right
)
Public Function Multiply (
	right As Transform1D
) As Transform1D
public:
Transform1D^ Multiply(
	Transform1D^ right
)
member Multiply :
        right : Transform1D -> Transform1D
Parameters
right Transform1D
 The input transformation.
Return Value
Transform1D
 The transformation equal to the composition of the two transformations.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The combined transformation has the same effect as applying the input transformation first, and this transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace